#   Асимметричный алгоритм шифрования
# Цель работы: исследование структуры асимметричных алгоритмов шифрования: RSA, DSA, схема Эль-Гамаля, ГОСТ P 34.10- 2001.
# Задания:
# 1. Реализовать один из существующих асимметричных алгоритмов шифрования: RSA, DSA, схема Эль-Гамаля, ГОСТ P 34.10- 2001.
# 2. Реализовать разработанный алгоритм на любом языке программирования.
# Методика выполнения практической работы. 
#   Выбрать один из алгоритмов симметричного шифрования, изучить алгоритм его работы и реализовать на каком-либо языке программирования.
# Требования к работе:
# - программа шифрования должна быть наделена понятным и удобным пользовательским интерфейсом;
# - полная реализация выбранного алгоритма;
# - запрещено использование любых сторонних библиотек.