#   Хеш-функции
# Цель работы: исследование структуры алгоритмов хеширования: MDS, MD6, CRC, HAVAL, SHA-2, ГОСТ P 34.11-94.
# Задания:
# 1. Реализовать одну из существующих функций хеширования: MD5, MD6, CRC, HAVAL, SHA-2, ГОСT P 34.11-94.
# 2. Реализовать алгориты работы функции хеширования на любом языке программирования.
# Методика вылолнения практической работы. Рассмотреть одну из функций хеширования. Изучить алгоритм работы выбранной функции и после этого реализовать на каком-либо языке программирования.
# Требования к работе:
# - программа шифрования должна быть наделена понятным и удобным пользовательским интерфейсом;
# -полная реализация выбранной функции хеширования.