#   Защита программ от несанкционированного копировании
# Цель работы: исследование защиты программ от несанкционированного копирования.
# Задание:
# 1. Разработать приложение, которос при установке на другой компьютер выдавало бы сообщение о нелегальности использовании,
# 2. Испольтуя ранее реализованную функцию хеширования, создать хеш-код для строки, содержащей индивидуальную информацию о компьютере, в качестве такой информации должна служить информация о компьютере.
# Методика выполнения практической работы, Ознакомиться со способами защиты программ от несанкционированного копирования, способами получения индивидуальной информации о компьютере. Используя результаты практической работы № 4, реализовать зашищенное от копирования приложение.
# Требовании к работе:
# - генерируемый хэш-код должен быть привязан к программному и аппаратному обеспечению;
# - смена аппаратного и программного обеспечения должна приводить к сообщению о нелегальном использовании программы; - запрещено использование любых сторонних библиотек.