#   Алгоритм шифрования
# Цель работы: проанализировать существующие простейшие алгоритмы шифрования.
# Задания:
# 1. Разработать собственный алгоритм шифрования.
# 2. Разработать форму, содержащую: 3 текстовых поля, кнопку «Шифровать», кнопку «Расшифровать».
# 3. Реализовать разработанный алгоритм на любом языке программирования.
# Методика выполнения практической работы. Ознакомиться с существующими простыми алгоритмами шифрования. В результате изучения алгоритмов и анализа литературы сформировать принципы работы алгоритмов шифрования.
# Требования к работе:
# - программа шифрования должна быть наделена понятным и удобным пользовательским интерфейсом;
# - алгоритм шифрования в обязательном порядке должен использовать математические и/или побитовые функции;
# - разработанный алгоритм должен приводить к полной утрате всех статистических закономерностей исходного сообщения.