#   Симметричный алгоритм шифрования
# Цель работы: исследование структуры симметричных алгоритмов шифрования: AES, ГOСT 28147-89 , DES, RC6, IDEA, SEED
# Задания:
# I. Реализовать один из существующих симметричных алгоритмов шифрования: AES, ГОСT 28147-89 , DES, RC6, IDEA, SEED.
# 2. Разработать форму, содержащую: 3 текстовых поля, кнопку «шифровать», кнопку «расшифровать», текстовое поле ключ для шифрации, текстовое поле ключ для дешифрации.
# 3. Организовать дополнительный интерфейс настройки алгоритма по необходимости.
# 4. Реализовать разработанный алгоритм на любом языке программирования.
# Методика выполнения практической работы. Изучить один из алгоритмов работы симметричного шифрования и реализовать на каком-либо языке программирования.
# Требования к работе:
# - программа шифрования должна быть наделена понятным и удобным пользовательским интерфейсом;
# - полная реализация выбранного алгоритма;
# - запрещено использование любых сторонних библнотек.