#   Алгоритм шифрования с ключом
# Цель работы: проанализировать существующие простейшие алгоритмы шифрования с ключом.
# Задания:
# 1. Разработать собственный алгоритм шифрования и дешифрования данных с ключом.
# 2. Разработать форму содержащую: 3 текстовых поля, кнопку «Шифровать», кнопку «Расшифровать», текстовое поле «Ключ» для шифрации, текстовое поле «Ключ» для дешифрации.
# 3. Реализовать разработанный алгоритм на любом языке программирования.
# Методика выполнения практической работы. Ознакомиться с существующими простыми алгоритмами шифрования с ключом. В результате изучения и анализа литературы сформировать принципы работы алгоритмов шифрования.
# Требования к работе:
# - программа шифрования должна быть наделена понятным и удобным пользовательским интерфейсом;
# алгоритм шифрования в обязательном порядке должен использовать математические и/или побитовые функции;
# - разработанный алгоритм должен приводить к полной утрате всех статистических закономерностей исходного сообщения;
# максимально возможная длина ключа шифрования 100 символов, минимальная длина ключа - 1 символ.